In [1]:
import pandas as pd
import numpy as np

In [31]:
df = pd.DataFrame({'Col1':[1,np.nan,3],
                  'Col2':[4,5,6],
                  'Col3':[7,8,np.nan]})

In [3]:
df

   Col1  Col2  Col3
0   1.0     4   7.0
1   NaN     5   8.0
2   3.0     6   NaN

In [4]:
df.dropna()

   Col1  Col2  Col3
0   1.0     4   7.0

In [5]:
df.dropna(axis = 1)

   Col2
0     4
1     5
2     6

In [6]:
df.fillna(0)

   Col1  Col2  Col3
0   1.0     4   7.0
1   0.0     5   8.0
2   3.0     6   0.0

In [7]:
np.mean(df['Col1'])

2.0

In [8]:
df.fillna(np.mean(df['Col1']))

   Col1  Col2  Col3
0   1.0     4   7.0
1   2.0     5   8.0
2   3.0     6   2.0

In [9]:
df

   Col1  Col2  Col3
0   1.0     4   7.0
1   NaN     5   8.0
2   3.0     6   NaN

In [21]:
col3 = df['Col3'].fillna(np.mean(df['Col3']))

In [23]:
df['Col3'] = col3

In [24]:
df

   Col1  Col2  Col3
0   1.0     4   7.0
1   2.0     5   8.0
2   3.0     6   7.5

In [25]:
df

   Col1  Col2  Col3
0   1.0     4   7.0
1   2.0     5   8.0
2   3.0     6   7.5

In [13]:
df['Col1'] = df['Col1'].fillna(np.mean(df['Col1']))

In [14]:
df

   Col1  Col2  Col3
0   1.0     4   7.0
1   2.0     5   8.0
2   3.0     6   NaN

In [12]:
df

   Col1  Col2  Col3
0   1.0     4   7.0
1   2.0     5   8.0
2   3.0     6   NaN

In [27]:
df

   Col1  Col2  Col3
0   1.0     4   7.0
1   NaN     5   8.0
2   3.0     6   NaN

In [32]:
df.fillna(value = 'Naveen')

     Col1  Col2    Col3
0     1.0     4     7.0
1  Naveen     5     8.0
2     3.0     6  Naveen